Just adding my steps to reproduce that simply adding a b_ssd does make the server reboot : 
```
provider "scaleway" {
	zone = var.main_zone
	organization_id = "329700f0-3730-4f3f-a62b-36b715fb5a4b" 
}
resource "scaleway_instance_security_group" "project_security_group" {
	name			= var.project_name
	description		= "Règles pour le cluster ${var.project_name}"
	inbound_default_policy  = "drop"
	outbound_default_policy = "accept"

	# SSH 
	inbound_rule {
		action		= "accept"
		ip		= "x"
		protocol	= "TCP"
	}
}
resource "scaleway_instance_ip" "ip" {}
resource "scaleway_instance_server" "project_srv" {
  name              = var.project_name
  image             = "b860f775-f5ff-4d48-8114-a3aeb65a9e26"
  type              = "DEV1-S"
  enable_ipv6       = true
  security_group_id = scaleway_instance_security_group.project_security_group.id
  ip_id             = scaleway_instance_ip.ip.id
  root_volume {
    delete_on_termination = true
    size_in_gb            = 20
  }
}
variable "main_zone" {
	default = "fr-par-2"
}
variable "project_name" {
	default = "test_ajout_resize_bssd"
}
terraform {
  required_providers {
    scaleway = {
      source	= "scaleway/scaleway"
    }
  }
}
```
Terraform init + apply : 
```
raphux@x1-carbon:/tmp/test_ajout_resize_bssd$ terraform init

Initializing the backend...

Initializing provider plugins...
- Finding latest version of scaleway/scaleway...
- Installing scaleway/scaleway v1.17.2...
- Installed scaleway/scaleway v1.17.2 (signed by a HashiCorp partner, key ID F5BF26CADF6F9614)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
raphux@x1-carbon:/tmp/test_ajout_resize_bssd$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # scaleway_instance_ip.ip will be created
  + resource "scaleway_instance_ip" "ip" {
      + address         = (known after apply)
      + id              = (known after apply)
      + organization_id = (known after apply)
      + reverse         = (known after apply)
      + zone            = (known after apply)
    }

  # scaleway_instance_security_group.project_security_group will be created
  + resource "scaleway_instance_security_group" "project_security_group" {
      + description             = "Règles pour le cluster test_ajout_resize_bssd"
      + external_rules          = false
      + id                      = (known after apply)
      + inbound_default_policy  = "drop"
      + name                    = "test_ajout_resize_bssd"
      + organization_id         = (known after apply)
      + outbound_default_policy = "accept"
      + stateful                = true
      + zone                    = (known after apply)

      + inbound_rule {
          + action   = "accept"
          + ip       = "xxx"
          + protocol = "TCP"
        }
    }

  # scaleway_instance_server.project_srv will be created
  + resource "scaleway_instance_server" "project_srv" {
      + boot_type                        = (known after apply)
      + disable_dynamic_ip               = false
      + disable_public_ip                = false
      + enable_dynamic_ip                = false
      + enable_ipv6                      = true
      + id                               = (known after apply)
      + image                            = "b860f775-f5ff-4d48-8114-a3aeb65a9e26"
      + ip_id                            = (known after apply)
      + ipv6_address                     = (known after apply)
      + ipv6_gateway                     = (known after apply)
      + ipv6_prefix_length               = (known after apply)
      + name                             = "test_ajout_resize_bssd"
      + organization_id                  = (known after apply)
      + placement_group_policy_respected = (known after apply)
      + private_ip                       = (known after apply)
      + public_ip                        = (known after apply)
      + security_group_id                = (known after apply)
      + state                            = "started"
      + type                             = "DEV1-S"
      + zone                             = (known after apply)

      + root_volume {
          + delete_on_termination = true
          + size_in_gb            = 20
          + volume_id             = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

scaleway_instance_ip.ip: Creating...
scaleway_instance_security_group.project_security_group: Creating...
scaleway_instance_ip.ip: Creation complete after 1s [id=fr-par-2/2a25be02-05ee-4b91-abb2-872a2fa3d954]
scaleway_instance_security_group.project_security_group: Creation complete after 2s [id=fr-par-2/1309dd5d-b199-444c-a8b2-4da4143900bf]
scaleway_instance_server.project_srv: Creating...
scaleway_instance_server.project_srv: Still creating... [10s elapsed]
scaleway_instance_server.project_srv: Still creating... [20s elapsed]
scaleway_instance_server.project_srv: Creation complete after 22s [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
raphux@x1-carbon:/tmp/test_ajout_resize_bssd$
```

Testing SSH a printing some uptimes info : 
```
raphux@x1-carbon:/tmp/test_ajout_resize_bssd$ ssh root@xxx
[...]
root@test-ajout-resize-bssd:~# dmesg -T | head -1
[Wed Jan 20 21:22:40 2021] Linux version 5.4.0-1026-kvm (buildd@lgw01-amd64-039) (gcc version 9.3.0 (Ubuntu 9.3.0-10ubuntu2)) #27-Ubuntu SMP Wed Sep 30 23:41:22 UTC 2020 (Ubuntu 5.4.0-1026.27-kvm 5.4.65)
root@test-ajout-resize-bssd:~# uptime
 21:23:46 up 1 min,  1 user,  load average: 0.22, 0.08, 0.03
root@test-ajout-resize-bssd:~# logout
Connection to xxx closed.
raphux@x1-carbon:/tmp/test_ajout_resize_bssd$
```
Adding a b_ssd to the conf : 
```
provider "scaleway" {
	zone = var.main_zone
	organization_id = "329700f0-3730-4f3f-a62b-36b715fb5a4b" 
}
resource "scaleway_instance_security_group" "project_security_group" {
	name			= var.project_name
	description		= "Règles pour le cluster ${var.project_name}"
	inbound_default_policy  = "drop"
	outbound_default_policy = "accept"

	# SSH 
	inbound_rule {
		action		= "accept"
		ip		= "x"
		protocol	= "TCP"
	}
}
resource "scaleway_instance_ip" "ip" {}
resource "scaleway_instance_server" "project_srv" {
  name              = var.project_name
  image             = "b860f775-f5ff-4d48-8114-a3aeb65a9e26"
  type              = "DEV1-S"
  enable_ipv6       = true
  security_group_id = scaleway_instance_security_group.project_security_group.id
  ip_id             = scaleway_instance_ip.ip.id
  root_volume {
    delete_on_termination = true
    size_in_gb            = 20
  }
  additional_volume_ids = [ scaleway_instance_volume.project_data_volume.id ]
}
resource "scaleway_instance_volume" "project_data_volume" {
    type       = "b_ssd"
    name       = "${var.project_name}_pv1"
    size_in_gb = 35
}
variable "main_zone" {
	default = "fr-par-2"
}
variable "project_name" {
	default = "test_ajout_resize_bssd"
}
terraform {
  required_providers {
    scaleway = {
      source	= "scaleway/scaleway"
    }
  }
}
```
Terraform apply : ```

raphux@x1-carbon:/tmp/test_ajout_resize_bssd$ terraform apply
scaleway_instance_ip.ip: Refreshing state... [id=fr-par-2/2a25be02-05ee-4b91-abb2-872a2fa3d954]
scaleway_instance_security_group.project_security_group: Refreshing state... [id=fr-par-2/1309dd5d-b199-444c-a8b2-4da4143900bf]
scaleway_instance_server.project_srv: Refreshing state... [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # scaleway_instance_server.project_srv will be updated in-place
  ~ resource "scaleway_instance_server" "project_srv" {
      ~ additional_volume_ids = [] -> (known after apply)
        id                    = "fr-par-2/a089369a-507b-427d-a301-2869c806d1f1"
        name                  = "test_ajout_resize_bssd"
        tags                  = []
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # scaleway_instance_volume.project_data_volume will be created
  + resource "scaleway_instance_volume" "project_data_volume" {
      + id              = (known after apply)
      + name            = "test_ajout_resize_bssd_pv1"
      + organization_id = (known after apply)
      + server_id       = (known after apply)
      + size_in_gb      = 35
      + type            = "b_ssd"
      + zone            = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

scaleway_instance_volume.project_data_volume: Creating...
scaleway_instance_volume.project_data_volume: Creation complete after 1s [id=fr-par-2/4cc988f3-be6c-4641-bcb5-0dffe9f4842f]
scaleway_instance_server.project_srv: Modifying... [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1]
scaleway_instance_server.project_srv: Still modifying... [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1, 10s elapsed]
scaleway_instance_server.project_srv: Still modifying... [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1, 20s elapsed]
scaleway_instance_server.project_srv: Still modifying... [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1, 30s elapsed]
scaleway_instance_server.project_srv: Still modifying... [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1, 40s elapsed]
scaleway_instance_server.project_srv: Still modifying... [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1, 50s elapsed]
scaleway_instance_server.project_srv: Still modifying... [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1, 1m0s elapsed]
scaleway_instance_server.project_srv: Still modifying... [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1, 1m10s elapsed]
scaleway_instance_server.project_srv: Still modifying... [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1, 1m20s elapsed]
scaleway_instance_server.project_srv: Modifications complete after 1m20s [id=fr-par-2/a089369a-507b-427d-a301-2869c806d1f1]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.
raphux@x1-carbon:/tmp/test_ajout_resize_bssd$
```
SSH into it and show that uptime as been reset : ```

raphux@x1-carbon:/tmp/test_ajout_resize_bssd$ ssh root@xxx
[...]
Last login: Wed Jan 20 21:23:22 2021 from 185.238.5.12
root@test-ajout-resize-bssd:~# dmesg -T | head -1
[Wed Jan 20 21:26:44 2021] Linux version 5.4.0-1026-kvm (buildd@lgw01-amd64-039) (gcc version 9.3.0 (Ubuntu 9.3.0-10ubuntu2)) #27-Ubuntu SMP Wed Sep 30 23:41:22 UTC 2020 (Ubuntu 5.4.0-1026.27-kvm 5.4.65)
root@test-ajout-resize-bssd:~# uptime
 21:27:15 up 0 min,  1 user,  load average: 0.17, 0.05, 0.01
root@test-ajout-resize-bssd:~# logout
Connection to xxx closed.
raphux@x1-carbon:/tmp/test_ajout_resize_bssd$
```

Reboot is also observed when increasing the b_ssd  size. If you need output, I can provide.